Tekla.Structures.Drawing.ViewBase
The ViewBase class is a base class for both the ContainerView class and the View class.

Tekla.Structures.Drawing.ViewBase.Width
The width of the view frame in paper coordinates.

Tekla.Structures.Drawing.ViewBase.Height
The height of the view frame in paper coordinates.

Tekla.Structures.Drawing.ViewBase.FrameOrigin
The vector from the view origin to the frame origin.

Tekla.Structures.Drawing.ViewBase.Origin
The view origin coordinates in the sheet.

Tekla.Structures.Drawing.ViewBase.ExtremaCenter
Gets the view extrema center.

Tekla.Structures.Drawing.ViewBase.IsSheet
Gets a value indicating whether the container view is the drawing's sheet.

Tekla.Structures.Drawing.ViewBase.GetAxisAlignedBoundingBox
The view size in paper coordinates.
Returns: The view size in paper coordinates.

Tekla.Structures.Drawing.ViewBase.LinkedDrawingId
The linked drawing of the containerview (only exists for actual linked drawing containerviews, otherwise 0)

Tekla.Structures.Drawing.ViewBase.Delete
Deletes the view and its children objects from the database.
Returns: True on success.

Tekla.Structures.Drawing.ViewBase.Modify
Modifies the view in the database.
Returns: True on success.

Tekla.Structures.Drawing.ViewBase.Insert
Inserts the view to the database.
Returns: True on success.

Tekla.Structures.Drawing.ViewBase.Select
Selects the view from the database.
Returns: True on success.

Tekla.Structures.Drawing.ViewBase.GetObjects
Gets the objects in the view. Does not return child objects (single dimensions, grid lines, views).
Returns: The objects in the view.

Tekla.Structures.Drawing.ViewBase.GetObjects(System.Type[])
Gets the objects in the view that are of certain types. Does not return child objects (single dimensions, grid lines, views).
TypeFilter: The types of the objects to get.
Returns: The objects in the view that are of certain types.

Tekla.Structures.Drawing.ViewBase.GetAllObjects
Gets all the objects and their children objects in the view.
Returns: All the objects in the view.

Tekla.Structures.Drawing.ViewBase.GetAllObjects(System.Type[])
Gets all the objects and their children objects in the view that are of certain types.
TypeFilter: The types of the objects to get.
Returns: All the objects in the view that are of certain types.

Tekla.Structures.Drawing.ViewBase.GetAllObjects(System.Type)
Gets all the objects and their children objects in the view that are of a certain type.
Type: The type of the objects to get.
Returns: All the objects in the view that are of a certain type.

Tekla.Structures.Drawing.ViewBase.GetModelObjects(Tekla.Structures.Identifier)
Gets the drawing model objects based on given model object identifier.
If used from sheet model objects from all views are returned.
ModelIdentifier: The identifier of the object in the model.
Returns: The model objects.

Tekla.Structures.Drawing.ViewBase.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.ViewBase.GetOriginalDrawing
Gets the drawing on which the view was originally created.
@see DrawingObject.GetDrawing() for retrieving the current drawing the object resides on.
Returns: The drawing from which the view was made, or NULL if it is not from another drawing.